'use strict'

// a list of commonly used words that have little meaning and can be excluded
// from analysis.
const words = [
  'о', 'після', 'всі', 'також', 'і', 'інші', 'все', 'як', 'в', 'бути',
  'тому', 'був', 'до', 'є', 'між', 'вся', 'але', 'від', 'іди', 'можу',
  'підійди', 'міг', 'робив', 'роблю', 'кожен', 'для', 'звідки', 'мав',
  'він', 'має', 'її', 'тут', 'його', 'якщо', 'у', 'воно', 'за',
  'робити', 'багато', 'може бути', 'самий', 'повинен',
  'мій', 'ніколи', 'зараз', 'із', 'на', 'тільки', 'або', 'наше', 'поза',
  'кінець', 'сказав', 'сказала', 'бачив', 'з',
  'трохи', 'все ще', 'так', 'потім', 'той', 'їх', 'там', 'цей', 'вони', 'те',
  'через', 'теж', 'під', 'над', 'дуже', 'був', 'добре',
  'що', 'де', 'який', 'доки', 'хто', 'хотів би',
  'а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'й', 'ї', 'к',
  'л', 'м', 'н', 'o', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ',
  'ь', 'ю', 'я', '$', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '_']

// tell the world about the noise words.
exports.words = words
